expense_categories = {
    'Cупермаркеты': ['пятерочка', 'магнит', 'магазин', 'супермаркет', 'ларек', 'кб', 'красное белое', 'бристоль'
                     'высшая лига', 'лента', 'ашан', 'спар'],
    'Фастфуд': ['макдак', 'мак', 'вкусноиточка', 'бургер кинг', 'бк', 'кфс', 'пицца', 'роллы', 'суши'],
    'Книжные магазины': ['книга', 'читай город', 'книжный'],
    'Техника': ['днс', 'ситилинк', 'эльдорадо', 'мвидео'],
    'Проезд': ['троллейбус', 'автобус', 'маршрутка', 'такси'],
    'Одежда и Аксессуары': ['эйчедм', 'рынок', 'базар', 'магазин одежды'],
    'Игры': ['дота', 'кс', 'фортнайт', 'радуга', 'танки']
}
