from collections import namedtuple
from PyQt5 import QtGui


expense_categories = {
    'Cупермаркеты': ['пятерочка', 'магнит', 'магазин', 'супермаркет', 'ларек', 'кб', 'красное белое', 'бристоль'
                     'высшая лига', 'лента', 'ашан', 'спар'],
    'Фастфуд': ['макдак', 'мак', 'вкусноиточка', 'бургер кинг', 'бк', 'кфс', 'пицца', 'роллы', 'суши'],
    'Книги': ['книга', 'читай город', 'книжный'],
    'Техника': ['днс', 'ситилинк', 'эльдорадо', 'мвидео'],
    'Проезд': ['троллейбус', 'автобус', 'маршрутка', 'такси'],
    'Одежда': ['эйчедм', 'рынок', 'базар', 'магазин одежды', 'одежда', 'торговый центр'],
    'Игры': ['дота', 'кс', 'фортнайт', 'радуга', 'танки', 'игра'],
    'Образование': ['вуз', 'школа']
}

Data = namedtuple('Data', ['name', 'value', 'primary_color', 'secondary_color'])
colors = ["#454895", "#32a645", "#13ba9b", "#670e9e", "#a80f87", "#94a80f", "#824710", "#0d9e72", "#c20a16"]
